# D√≠a 17: VLANs (Parte 2) - Trunks y Router on a Stick

## Puertos Trunk (Trunk Ports)

Un **puerto trunk** es un enlace que puede transportar tr√°fico de m√∫ltiples VLANs simult√°neamente. En lugar de usar un cable f√≠sico por cada VLAN para conectar switches entre s√≠ o con un router, se utiliza un √∫nico enlace trunk. Esto optimiza el uso de puertos y es una soluci√≥n escalable para redes con muchas VLANs.

Los switches "etiquetan" las tramas que env√≠an a trav√©s de un enlace troncal para que el switch receptor sepa a qu√© VLAN pertenece cada trama.

- **Puertos Trunk**: Puertos "etiquetados" (tagged).
- **Puertos de Acceso**: Puertos "no etiquetados" (untagged).

![Topolog√≠a de red con puerto trunk](images/dia17/topologia-trunk.png)

---

## Encapsulaci√≥n 802.1Q (dot1q)

**IEEE 802.1Q** es el est√°ndar de la industria para el etiquetado de VLANs en redes Ethernet. Inserta una etiqueta de 4 bytes en la trama Ethernet original, entre la direcci√≥n MAC de origen y el campo de Tipo/Longitud. El antiguo protocolo propietario de Cisco, **ISL**, ya no se utiliza en equipos modernos.

La etiqueta 802.1Q contiene informaci√≥n crucial para identificar la VLAN y priorizar el tr√°fico.

![Estructura de la trama Ethernet con etiqueta 802.1Q](images/dia17/trama-802-1q.png)

### Campos de la Etiqueta 802.1Q



| Campo                          | Tama√±o   | Descripci√≥n                                                                 |
|--------------------------------|----------|-----------------------------------------------------------------------------|
| **TPID (Tag Protocol Identifier)** | 16 bits | Valor fijo (0x8100 en Ethernet) que indica que la trama lleva etiqueta 802.1Q. |
| **PCP (Priority Code Point)**  | 3 bits   | Define la prioridad del tr√°fico (QoS, IEEE 802.1p). Valores de 0 a 7 (8 niveles). |
| **DEI (Drop Eligible Indicator)** | 1 bit | Se√±ala si la trama es elegible para ser descartada en caso de congesti√≥n (0 = no, 1 = s√≠). |
| **VID (VLAN Identifier)**      | 12 bits  | Identifica la VLAN a la que pertenece el frame. Valores v√°lidos: 1‚Äì4094. (0 = sin VLAN, solo prioridad; 4095 = reservado). |
| **TCI (Tag Control Information)** | 16 bits | Conjunto de los campos PCP, DEI y VID (3 + 1 + 12 bits). Contiene la informaci√≥n de control de la VLAN. |
### VLAN Range
* El rango total de VLAN es **1 ‚Äì 4094**.
* Se dividen en:

  * **VLAN normales:** 1 ‚Äì 1005
  * **VLAN extendidas:** 1006 ‚Äì 4094
* En dispositivos antiguos no siempre funcionan las VLAN extendidas.
* Los **switches modernos s√≠ las soportan**.

### Native VLAN

La **Native VLAN** es una caracter√≠stica de 802.1Q. Por defecto es la **VLAN 1**. Las tramas que pertenecen a la Native VLAN se env√≠an **sin etiqueta** a trav√©s del puerto trunk. Si un switch recibe una trama sin etiqueta en un puerto trunk, asume que pertenece a la Native VLAN.

**¬°Importante!** La configuraci√≥n de la Native VLAN debe ser la misma en ambos extremos del enlace troncal para evitar problemas de comunicaci√≥n y seguridad.

![Ejemplo de native VLAN mismatch](images/dia17/native-vlan-mismatch.png)

---

## Configuraci√≥n de Puertos Trunk

Para configurar un puerto como troncal en un switch Cisco, se utilizan los siguientes comandos:

1.  **Seleccionar la interfaz:** `interface <nombre_interfaz>`
2.  **Establecer encapsulaci√≥n (en switches antiguos):** `switchport trunk encapsulation dot1q`
3.  **Configurar el modo trunk:** `switchport mode trunk`
4.  **(Opcional) Configurar la Native VLAN:** `switchport trunk native vlan <vlan_id>`
5.  **(Opcional) Limitar las VLANs permitidas:** `switchport trunk allowed vlan <lista_de_vlans>`


## Ejemplo Completo de Configuraci√≥n y Verificaci√≥n

### Configuraci√≥n de la Interfaz en Modo Trunk

```bash
SW1# configure terminal
SW1(config)# interface g0/0
SW1(config-if)# switchport trunk encapsulation dot1q
SW1(config-if)# switchport mode trunk
```

Verificamos el modo trunk:

```bash
SW1# show interfaces trunk
```

![Trunk Config](images/dia17/trunk-interfaces.png)

---

## Opciones del Comando `switchport trunk allowed vlan ?`
Por defecto, el trunk permite todas las VLANs (1‚Äì4094), pero podemos restringir, agregar, quitar o excluir VLANs espec√≠ficas con el comando:
Cuando ejecutamos:

```bash
SW1(config-if)# switchport trunk allowed vlan ?
```

Aparece:

```
  WORD     VLAN IDs of the allowed VLANs when this port is in trunking mode
  add      Add VLANs to the current list
  all      All VLANs
  except   All VLANs except the following
  none     No VLANs
  remove   Remove VLANs from the current list
```

---

### 1. **WORD ‚Üí Definir lista manual de VLANs**

```bash
SW1(config-if)# switchport trunk allowed vlan 10,30
```

Verificaci√≥n:

```bash
SW1# show interfaces trunk
Port      Vlans allowed on trunk
Gi0/0     10,30
```

---

### 2. **add ‚Üí Agregar VLANs a la lista actual**

```bash
SW1(config-if)# switchport trunk allowed vlan add 20
```

Verificaci√≥n:

```bash
SW1# show interfaces trunk
Port      Vlans allowed on trunk
Gi0/0     10,20,30

Port      Vlans allowed and active in management domain
Gi0/0     10,30
```

### 3. **all ‚Üí Permitir todas las VLANs**

```bash
SW1(config-if)# switchport trunk allowed vlan all
```

Verificaci√≥n:

```bash
SW1# show interfaces trunk
Port      Vlans allowed on trunk
Gi0/0     1-4094
```


---

---

## 4. **except ‚Üí Todas excepto algunas**

```bash
SW1(config-if)# switchport trunk allowed vlan except 1-5,10
```

Verificaci√≥n:

```bash
SW1# show interfaces trunk
Port      Vlans allowed on trunk
Gi0/0     6-9,11-4094
```

---

### 5. **none ‚Üí No permitir ninguna VLAN**

```bash
SW1(config-if)# switchport trunk allowed vlan none
```

Verificaci√≥n:

```bash
SW1# show interfaces trunk
Port      Vlans allowed on trunk
Gi0/0     none
```

---

### 6. **remove ‚Üí Quitar VLANs de la lista actual**

```bash
SW1(config-if)# switchport trunk allowed vlan remove 20
```

Verificaci√≥n:

```bash
SW1# show interfaces trunk
Port      Vlans allowed on trunk
Gi0/0     10,30
```

---

### üìä Tabla Resumen

| Comando                                        | Efecto                            | Salida esperada en `show interfaces trunk` |
| ---------------------------------------------- | --------------------------------- | ------------------------------------------ |
| `switchport trunk allowed vlan 10,20,30,99`    | Define lista manual de VLANs      | `10,20,30,99`                              |
| `switchport trunk allowed vlan add 40,50`      | Agrega VLANs a la lista existente | `10,20,30,40,50,99`                        |
| `switchport trunk allowed vlan all`            | Permite todas las VLANs           | `1-4094`                                   |
| `switchport trunk allowed vlan except 100,200` | Permite todas excepto 100 y 200   | `6-9,11-4094`                   |
| `switchport trunk allowed vlan none`           | Bloquea todas las VLANs           | `none`                                     |
| `switchport trunk allowed vlan remove 30,40`   | Quita VLANs de la lista actual    | `10,30`                              |

El comando show vlan brief muestra los puertos de acceso asignados a cada VLAN, no los puertos trunk que permiten pasar cada VLAN.
Para verificar los puertos trunk, usa show interfaces trunk.


**show vlan brief** ‚Üí puertos de acceso por VLAN.

**show interfaces trunk**‚Üí puertos trunk y VLANs que permiten.

Por motivos de seguridad, es recomendable cambiar la VLAN nativa a una VLAN que no se est√© usando.
Aseg√∫rate de que la VLAN nativa coincida entre los switches.

---


## Router on a Stick (ROAS)

**Router on a Stick (ROAS)** es una t√©cnica para enrutar tr√°fico entre diferentes VLANs usando una √∫nica interfaz f√≠sica del router. El enlace entre el switch y el router se configura como un puerto trunk.
![Topolog√≠a de Router on a Stick](images/dia17/roas-topology.png)
En el router, la interfaz f√≠sica se divide en **subinterfaces l√≥gicas**, una por cada VLAN que se desea enrutar. A cada subinterfaz se le asigna:
- Una encapsulaci√≥n 802.1Q con el ID de la VLAN correspondiente.
- Una direcci√≥n IP que funcionar√° como el *default gateway* para los dispositivos de esa VLAN.

![Topolog√≠a de Router on a Stick](images/dia17/roas-topology-subinterfaces.png)
Funcionamiento:

El router interpreta que las tramas entrantes con una etiqueta VLAN espec√≠fica pertenecen a la subinterfaz configurada con esa VLAN.

Al enviar tramas, el router etiqueta cada trama seg√∫n la VLAN configurada en la subinterfaz correspondiente.
### Ejemplo de Configuraci√≥n ROAS en el Router

```

R1\# configure terminal
R1(config)\# interface GigabitEthernet0/0
R1(config-if)\# no shutdown 
R1(config-if)\# interface GigabitEthernet0/0.10
R1(config-subif)\# encapsulation dot1q 10
R1(config-subif)\# ip address 192.168.1.62 255.255.255.192
R1(config-subif)\# exit
R1(config)\# interface GigabitEthernet0/0.20
R1(config-subif)\# encapsulation dot1q 20
R1(config-subif)\# ip address 192.168.1.126 255.255.255.192
R1(config-subif)\# exit
R1(config)\# interface GigabitEthernet0/0.30
R1(config-subif)\# encapsulation dot1q 30
R1(config-subif)\# ip address 192.168.1.190 255.255.255.192
R1(config-subif)\# exit

```